app/views/book_comments/_comment.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
  <% books.book_comments.each do |book_comment| %>