app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = current_user
    @book = Book.find(params[:id])

SELECT "books".* FROM "books"
---
  def index
    @user = current_user
    @book = Book.new
    @books = Book.all

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "s"], ["body", "s"], ["user_id", 1], ["created_at", "2022-11-10 05:10:43.746509"], ["updated_at", "2022-11-10 05:10:43.746509"]]
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save